
import LocalizedStrings from 'react-localization';


const strings = new LocalizedStrings({
	en:{

		'пишите сюда' : 'write here', 

		'Какие-то проблемы?' : 'Any problems?',

		'Найдётся что угодно' : 'find whatever',

		'Описания для этого ассета нет.' : 'There is no description for this asset.',
		
		'Описание' : 'Description',

		'Ошибка 2' : 'Error',
		
		'Файл скачан' : 'File downloaded',

		'Удалить' : 'Delete',

		'Редактировать' : 'Edit',

		'Удалить ассет?' : 'delete the asset?',

		'Ассет удалён' : 'Asset deleted',
		
		'или' : 'or',

		'Не удалось подключиться к серверу' : 'Failed to connect to the server',

		'Прочее' : 'Other',

		'Открыть' : 'Open',

		'Путь к файлам чита' : 'The path to the cheat files',

		'Скопировано в буфер' : 'Copied to clipboard',

		'Лаунчер запускается вместе с Windows.' : 'The launcher starts with Windows.',

		'Лаунчер обнаруживает запущенную игру и инжектит чит.' : 'The launcher detects the running game and injects the cheat.',
		
		'Придумайте описание(опционально)' : 'Come up with a description (optional)',
		
		'Загружено больше чем 7 изображений' : 'Uploaded more than 7 images',

		'Не удалось найти файл' : `Couldn't find the file`,

		'Загрузить ассет' : 'Upload asset',

		'Выберите контент' : 'Select content',

		'Загрузите изображения' : 'upload an images', 

		'Придумайте название ассета' : 'Come up with the name of the asset',

		'Количество скачиваний ассета' : 'Number of downloads',
		
		'Дата создания ассета' : 'Date of creation',

		'Тип ассета' : 'Type',

		'Автор ассета' : `Author`,

		'Название ассета' : 'Name',

		'История Обновлений' : 'Update History',

		'Не удалось загрузить изображение пользователя. Ошибка: ' : 'The image of user could not be uploaded. Mistake:', 
		
		'Ошибка авторизации': 'Authorization error',
		
		'Не удалось загрузить инжектор' : 'Failed to load injector', 

		'Загрузка инжектора': 'Loading the injector',

		Подождите : 'Wait',

		НеНайденИнжектор : 'Injector not found.',
		ЛибоОнНеБылУстановленЛибоЕгоУдалилАнтивирус : 'Either it was not installed, or the antivirus removed it',
		
		НеУдалосьЗагрузитьЛаунчер : 'Failed to load launcher.',

		ВойдитеВАккаунтЛибоЗарегистрируйтесьЧтобыПользоватьсяЛаунчером : 'Login to your account or register to use the launcher.', 

		ОшибкаАвторизации : 'Authorization error',

		Язык : "Language",

		НастройкиЛаунчера : "Settings of launcher",

		АвторАссета : 'Author',

		ТипАссета : 'Type',

		ДатаАссета :  'Date of publication',

		КоличествоСкачиваний : 'Install count',

		НеправильныйЛогинИлиПароль : "Incorrect login or password",

		ФайлаНеСуществует : "File doesn't exist!",

		Название : "Name", 

		ВыберитеИзображение : "Select Image",

		ТакоеНазваниеУжеСуществует : "Such the name already exists!",

		НазваниеНеДолжноБытьПустым : "The name should not be empty!",

		Опубликовать : "Publish",

		ВыберитеКонтент : "Select Content",

		IngectorОбновляется : 'injector updating',

		Автозапуск : "Auto start",

		Автоинжект : "Auto inject",

		Настройки : "Settings",

		Профиль:"Profile",

		Роль : "Role",

		ПодождатьОкончанияЗагрузки : 'Wait for the download to finish.',

		НажатьКнопкуInject :  'Click the inject button.',

		ЗапуститьИгру :'Launch the game.',

		ИнструкцияПоЗапуску : 'Launch Instructions.',

		//Выйти из аккаунта
		Выйти:"Logout",
		//Главная сайта
		Главная:"Main",
		//Продукты
		Продукты:"Products",

		Логин:"Login",

		Пароль:"password",

		Зарегистрироваться:"Registration",

		ЗабылиПароль:"Forgot your password?",

		Скачать:"Download",

		МойПрофиль:"My profile",

		Баланс:"Balance",

		Войти:"Login",

		Актировать_ключ:"Activate key",

		Активировать:"Activate",

		Ошибка:"Failed",

		Успех:"Success",

	},
	ru: {

		'пишите сюда' : 'пишите сюда', 
		
		'Какие-то проблемы?' : 'Какие-то проблемы?',


		'Найдётся что угодно' : 'Найдётся что угодно',
		
		'Описания для этого ассета нет.' : 'Описания для этого ассета нет.',

		'Описание' : 'Описание',

		'Ошибка 2' : 'Ошибка',
		
		'Файл скачан' : 'Файл скачен',

		'Удалить' : 'Удалить',

		'Редактировать' : 'Редактировать',

		'Удалить ассет?' : 'Удалить ассет?',

		'Ассет удалён' : 'Ассет удалён',

		'или' : 'или',

		'Не удалось подключиться к серверу' : 'Не удалось подключиться к серверу',

		'Прочее' : 'Прочее',
		
		'Открыть' : 'Открыть',

		'Путь к файлам чита' : 'Путь к файлам чита',


		'Скопировано в буфер' : 'Скопировано в буфер',

		'Лаунчер запускается вместе с Windows.' : 'Лаунчер запускается вместе с Windows.',

		'Лаунчер обнаруживает запущенную игру и инжектит чит.' : 'Лаунчер обнаруживает запущенную игру и инжектит чит.',


		'Придумайте описание(опционально)' : 'Придумайте описание(опционально)',

		'Загружено больше чем 7 изображений' : 'Загружено больше чем 7 изображений',
		

		'Не удалось найти файл' : 'Не удалось найти файл',

		'Загрузить ассет' : 'Загрузить ассет',

		'Выберите контент' : 'Выберите контент',

		'Загрузите изображения' : 'Загрузите изображения', 

		'Придумайте название ассета' : 'Придумайте название ассета',


		'Количество скачиваний ассета' : 'Количество скачиваний',

		'Дата создания ассета' : 'Дата создания',

		'Тип ассета' : 'Тип',

		'Автор ассета' : `Автор`,

		'Название ассета' : 'Название',

		'История Обновлений' : 'История обновлений',

		'Не удалось загрузить изображение пользователя. Ошибка: ' : 'Не удалось загрузить изображение пользователя. Ошибка: ', 

		'Ошибка авторизации': 'Ошибка авторизации',

		'Не удалось загрузить инжектор' : 'Не удалось загрузить инжектор', 

		'Загрузка инжектора': 'Загрузка инжектора',

		Подождите : 'Подождите',

		НеНайденИнжектор : 'Не найден инжектор.',
		ЛибоОнНеБылУстановленЛибоЕгоУдалилАнтивирус : 'Либо он не был установлен, либо его удалил антивирус',

		НеУдалосьЗагрузитьЛаунчер : 'Не удалось загрузить лаунчер.',

		ВойдитеВАккаунтЛибоЗарегистрируйтесьЧтобыПользоватьсяЛаунчером : 'Войдите в аккаунт либо зарегистрируйтесь, чтобы пользоваться лаунчером.',

		ОшибкаАвторизации : 'Ошибка авторизации',

		НеправильныйЛогинИлиПароль : "Неправильный логин или пароль",

		Пароль : "Пароль",

		Язык : "Язык",

		НастройкиЛаунчера : "Настройки лаунчера",

		ФайлаНеСуществует : "Файла не существует!",

		Опубликовать : "Опубликовать",

		Название : "Название", 

		ВыберитеИзображение : "Выберите изображение",

		ТакоеНазваниеУжеСуществует : "Такое название уже существует!",

		НазваниеНеДолжноБытьПустым : "Название не должно быть пустым!",

		ВыберитеКонтент : "Выберите контент",
		
		Автозапуск : "Автозапуск",

		Автоинжект : "Автоинжект",

		Настройки : "Настройки",

		Роль : "Роль",

		ИнструкцияПоЗапуску : 'Инструкция по запуску.',

		ЗапуститьИгру :'Запустить игру.',

		НажатьКнопкуInject :  'Нажать кнопку inject.',

		ПодождатьОкончанияЗагрузки : 'Подождать окончания загрузки.',

		IngectorОбновляется : 'injector обновляется',

		АвторАссета : 'Автор',

		ТипАссета : 'Тип',

		ДатаАссета :  'Дата создания',

		КоличествоСкачиваний : 'Количество скачиваний',
		//Выйти из аккаунта
		Выйти:"Выйти",
		//Главная сайта
		Главная:"Главная",
		//Продукты
		Продукты:"Продукты",

		Логин:"Логин",


		Зарегистрироваться:"Зарегистрироваться",

		ЗабылиПароль:"Забыли Пароль?",

		Скачать:"Скачать",

		Профиль:"Профиль",

		Баланс:"Баланс",


		МойПрофиль:"Мой профиль",

		Войти:"Войти",

		Актировать_ключ:"Актировать ключ",

		Скачать_инжектор:"Скачать инжектор",

		Скачать_файлы_для_чита:"Скачать файлы для чита",

		Активировать:"Активировать",

		Ошибка:"Ошибка",

		Успех:"Успех",
	}
});

export default strings;